src/Documents/Контроль/Контроль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Контроль</name>
  <basedOn>Document.ЗапросКлиента</basedOn>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесПеревес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесПЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрихода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросКлиента</name>
    <type>
      <types>DocumentRef.ЗапросКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Линия</name>
    <type>
      <types>CatalogRef.Линия</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ПакингЛист</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>CatalogRef.Порты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортВыгрузка</name>
    <type>
      <types>CatalogRef.Порты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКонтроль</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаОтправления</name>
    <type>
      <types>CatalogRef.Страны</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗабрали</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>DefinedType.Транспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/ПорядокДокументовКонтроль/ПорядокДокументовКонтроль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокДокументовКонтроль</name>
  <resources>
    <name>ПорядокСортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef.Контроль</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ЗапросКлиента/ЗапросКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросКлиента</name>
  <attributes>
    <name>Выгрузка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идея</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.КоличествоГруза</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ПакингЛист</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>CatalogRef.Порты</types>
    </type>
  </attributes>
  <attributes>
    <name>Разница</name>
    <type>
      <types>DefinedType.КоличествоГруза</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОтдача</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатеж</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПросчет</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/Контроль/ObjectModule.bsl
Процедура ПередЗаписью ( Отказ, РежимЗаписи, РежимПроведения )
	
	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	Если ( ПометкаУдаления ) Тогда
		РегистрыСведений.ПорядокДокументовКонтроль.УдалитьЗаписи ( Ссылка );
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи ( Отказ )
	
	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура заполнитьДополнительныеСвойства ()
	
	ДополнительныеСвойства.Вставить ( "Перепроведение", Проведен );
	ДополнительныеСвойства.Вставить ( "ОперативноеПроведение", ( ЭтоНовый () И НачалоДня ( Дата ) = НачалоДня ( ТекущаяДата () ) ) ); 
	
КонецПроцедуры 

Процедура ОбработкаПроведения ( Отказ, РежимПроведения )
	
	заполнитьДополнительныеСвойства	();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения ( ДанныеЗаполнения, СтандартнаяОбработка ) Экспорт 
	
	Если ТипЗнч ( ДанныеЗаполнения ) = Тип ( "ДокументСсылка.ЗапросКлиента" ) Тогда
		заполнитьПоЗапросКлиента ( ДанныеЗаполнения );
	КонецЕсли;
	
КонецПроцедуры

Процедура заполнитьПоЗапросКлиента ( Данные )
	
	ЗапросКлиента = Данные.Ссылка;
	с = "
	|выбрать
	|	Контрагент как Контрагент,
	| 	Организация как Организация,
	|	ПакингЛист как ПакингЛист,
	|	Количество как Количество,
	|	Порт как Порт 
	|из
	|	Документ.ЗапросКлиента
	|где
	|	Ссылка = &Ссылка  
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "Ссылка", Данные.Ссылка );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	Пока ( выборка.Следующий () ) Цикл
		Контрагент = выборка.Контрагент;
		Организация = выборка.Организация;
		ПакингЛист = выборка.ПакингЛист;
		ВесПЛ = выборка.Количество;
		Порт = выборка.Порт;
	КонецЦикла; 
	
КонецПроцедуры
